In [1]:
%autosave 0

Autosave disabled

In [1]:
import pandas as pd

from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import classification_report
from adam_prepare import titanic_pipeline

Let's read in our data using the titanic_pipeline function!

In [2]:
train, val, test = titanic_pipeline()

found data

Let's take a peek at train. Some of my values are strings. Can (most) machine learning models handle strings?

In [3]:
train.head()

,survived,sex,age,sibsp,parch,fare,class,deck,embark_town,alone
748,0,male,19.0,1,0,53.1000,First,D,Southampton,0
45,0,male,29.0,0,0,8.0500,Third,NaN,Southampton,1
28,1,female,29.0,0,0,7.8792,Third,NaN,Queenstown,1
633,0,male,29.0,0,0,0.0000,First,NaN,Southampton,1
403,0,male,28.0,1,0,15.8500,Third,NaN,Southampton,0

We need to determine a way to meaningfully encode our string values.

We will use [pd.get_dummies](https://pandas.pydata.org/docs/reference/api/pandas.get_dummies.html) to [one-hot encode](https://machinelearningmastery.com/why-one-hot-encode-data-in-machine-learning/) our categorical columns.

In [7]:
train = pd.get_dummies(train, columns = ['sex'], drop_first = True) 
train = pd.get_dummies(train, columns = ['class', 'embark_town'])
train.head()

,survived,age,sibsp,parch,fare,deck,alone,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
748,0,19.0,1,0,53.1000,D,0,1,1,0,0,0,0,1
45,0,29.0,0,0,8.0500,NaN,1,1,0,0,1,0,0,1
28,1,29.0,0,0,7.8792,NaN,1,0,0,0,1,0,1,0
633,0,29.0,0,0,0.0000,NaN,1,1,1,0,0,0,0,1
403,0,28.0,1,0,15.8500,NaN,0,1,0,0,1,0,0,1

In [11]:
val = pd.get_dummies(val, columns = ['sex'], drop_first = True) 
val = pd.get_dummies(val, columns = ['class', 'embark_town'])
val.head()

,survived,age,sibsp,parch,fare,deck,alone,sex_male,class_First,class_Second,class_Third,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton
377,0,27.0,0,2,211.500,C,0,1,1,0,0,1,0,0
244,0,30.0,0,0,7.225,NaN,1,1,0,0,1,1,0,0
72,0,21.0,0,0,73.500,NaN,1,1,0,1,0,0,0,1
815,0,29.0,0,0,0.000,B,1,1,1,0,0,0,0,1
841,0,16.0,0,0,10.500,NaN,1,1,0,1,0,0,0,1

In [12]:
train.shape, val.shape

((623, 14), (134, 14))

Let's make sure our three subsets (train, validate, test) all have the same number of columns!

Now that our categorical data is properly encoded, let's make X and y dataframes for model training and evaluation.

In [15]:
X_train = train.drop(columns = ['survived'])
Y_train = train.survived

X_val = val.drop(columns = ['survived'])
Y_val = val.survived

We should define a baseline before we get started! Our baseline will be the most likely outcome from the y_train series.

In [17]:
Y_train.mode()

0    0
Name: survived, dtype: int64

In [19]:
base_acc = (Y_train == 0).mean()

We're ready to model! Let's create an instance of a [DecisionTreeClassifier](https://scikit-learn.org/stable/modules/generated/sklearn.tree.DecisionTreeClassifier.html) and fit it to our train dataset.

In [ ]:
seed = 42

clf = DecisionTreeClassifier(random_state = seed)

clf.fit()

Let's check out the .feature_importances_ attribute.

Let's make some predictions with the .predict() method and save them to a variable.

Let's evaluate the accuracy of our model with the .score() method.

We can use the classification_report function to return a whole host of metrics about our model!

Wow! My model is incredible! I'm sure it will be equally awesome on the validate dataset!

What does it mean to be overfit?